lethanhphuc150501/STM32_DeviceDriver/Basic Embedded System Bare-Metal Programming Ground Up/14_InputCapture/Src/tim.c
#include "stm32f1xx.h"

#define TIM2EN			(1U<<0)
#define TIM3EN			(1U<<1)

#define CR1_CEN			(1U<<0)
#define OC_TOGGLE		((1U<<4) | (1U<<5))
#define CCER_CC1E		(1U<<0)
#define CCMR_CC1S		(1U<<0)

#define IOPAEN			(1U<<2)

void TIM2_1Hz_init(void)
{
	/* Enable clock access to TIM2 */
	RCC->APB1ENR |= TIM2EN;

	/* Set prescaler value */
	TIM2->PSC = 800 - 1; 				// 	8 000 000 / 800 = 10 000

	/* Set auto-reload value */
	TIM2->ARR = 10000 - 1;				// 10 000 / 10 000 = 1

	/* Clear counter */
	TIM2->CNT = 0;

	/* Enable timer */
	TIM2->CR1 |= CR1_CEN;
}

void TIM2_PA0_output_compare(void)
{
	/* Enable clock access to GPIOA */
	RCC->APB2ENR |= IOPAEN;

	/* Set PA0 mode to alternate function */
	GPIOA->CRL |= (1U<<1);
	GPIOA->CRL |= (1U<<0);
	GPIOA->CRL &=~(1U<<2);
	GPIOA->CRL |= (1U<<3);

	/* Enable clock access to TIM2 */
	RCC->APB1ENR |= TIM2EN;

	/* Set prescaler value */
	TIM2->PSC = 800 - 1; 				// 	8 000 000 / 800 = 10 000

	/* Set auto-reload value */
	TIM2->ARR = 10000 - 1;				// 10 000 / 10 000 = 1

	/* Set output compare toggle mode */
	TIM2->CCMR1 = OC_TOGGLE;

	/* Enable TIM2_CH1 in compare mode */
	TIM2->CCER |= CCER_CC1E;

	/* Clear counter */
	TIM2->CNT = 0;

	/* Enable TIM2 */
	TIM2->CR1 |= CR1_CEN;
}

void TIM3_PA6_input_capture(void)
{
	/* Enable clock access to GPIOA */
	RCC->APB2ENR |= IOPAEN;

	/* Set PA6 mode to alternate function */
	GPIOA->CRL &=~(1U<<24);
	GPIOA->CRL &=~(1U<<25);
	GPIOA->CRL &=~(1U<<27);
	GPIOA->CRL |= (1U<<26);

	/* Enable clock access to TIM3 */
	RCC->APB1ENR |= TIM3EN;

	/* Set prescaler value */
	TIM3->PSC = 8000;						//	8 000 000 / 8000 = 1000

	/* Set CH1 to input capture */
	TIM3->CCMR1 = CCMR_CC1S;

	/* Set CH1 to capture at rising edge */
	TIM3->CCER = CCER_CC1E;

	/* Enable TIM3 */
	TIM3->CR1 |= CR1_CEN;
}
